In [7]:
import pandas as pd
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df_new = df.replace([1, 3], [11, 33]) # Replaces 1 with 11 and 3 with 33
import re

In [2]:
df

   A  B
0  1  4
1  2  5
2  3  6

In [3]:
df_new

    A  B
0  11  4
1   2  5
2  33  6

In [49]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
df_new = df.replace({'A': 1, 'B': 5},99) # Replaces 1 in 'A' and 5 in 'B' with 99

In [50]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [51]:
df_new

    A   B  C
0  99   4  7
1   2  99  8
2   3   6  9

In [8]:
df = pd.DataFrame({'Text': ['apple_1', 'banana_2', 'cherry_3']})
df_new = df.replace(r'(\d+)', 'X', regex=True) # Replaces digits with 'X'

In [9]:
print("r'(\d+)",df)

r'(\d+)        Text
0   apple_1
1  banana_2
2  cherry_3

In [10]:
df['extracted_n'] = df['Text'].str.extract(r'(\d+)')

In [12]:
df['extracted_n']

0    1
1    2
2    3
Name: extracted_n, dtype: object

In [13]:
df_new = df.replace(r'(\d+)', 'X', regex=True)

In [14]:
df_new

       Text extracted_n
0   apple_X           X
1  banana_X           X
2  cherry_X           X

In [32]:
import numpy as np
df = pd.DataFrame({'A': [1, np.nan, 3], 'B': [np.nan, 2, 3]})
df_new = df.replace({np.nan: 0}) # Replaces all None entries with 0

In [33]:
df_new

     A    B
0  1.0  0.0
1  0.0  2.0
2  3.0  3.0

In [52]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [1, 5, 6], 'C': [1, 8, 9]})


df_new = df.replace({1: 99})

In [53]:
df_new

    A   B   C
0  99  99  99
1   2   5   8
2   3   6   9